'use client'
// import { PhoneCall } from 'lucide-react'
// import { Badge } from '@/components/ui/badge'
import { Spotlight } from '../about-us/components/spotlight'
import FAQ from './components/FAQ'
// import { Button } from '@/components/ui/button'

const faqs = [
  {
    id: '1',
    question: ' چرم مورد استفاده شما از چه نوعی است و منشأ آن کجاست؟',
    answer:
      'تمامی محصولات ما از چرم طبیعی گاو با بالاترین کیفیت و منشأ ایرانی (دباغی‌های معتبر اصفهان و تبریز) تهیه می‌شود. ما از چرم‌های مصنوعی (پلاستیکی) استفاده نمی‌کنیم.',
  },
  {
    id: '2',
    question: 'چگونه از طبیعی و اصل بودن چرم مطمئن شوم؟',
    answer:
      'چرم طبیعی دارای رگه‌ها، بافت و بوئی منحصر به فرد است که در چرم مصنوعی وجود ندارد. با گذشت زمان و استفاده، چرم طبیعی نرم‌تر و زیباتر می‌شود و پاتینا (جلای کهنه‌گی) می‌گیرد.',
  },
  {
    id: '3',
    question: 'آیا رنگ چرم ثابت است و روی لباس نمی‌ریزد؟',
    answer:
      'بله. از رنگ‌های باکیفیت و ثابت‌کننده‌های حرفه‌ای استفاده می‌کنیم. اما برای اطمینان بیشتر در اولین استفاده، توصیه می‌کنیم آن را با یک پارچه سفید و مرطوب به آرامی تماس دهید تا باقی‌مانده رنگ احتمالی پاک شود.',
  },
  {
    id: '4',
    question: ' آیا محصولات شما کاملاً دست‌ساز هستند؟',
    answer:
      'بله، تمام مراحل برش، دوخت (با دست یا چرخ خیاطی صنعتی)، رنگ‌آمیزی و پرداخت توسط هنرمندان ما به صورت دستی انجام می‌گیرد. این باعث می‌شود هر محصول منحصر به فرد و دارای هویتی خاص باشد',
  },
  {
    id: '5',
    question: 'چگونه می‌توانم اندازه صحیح کیف خود را انتخاب کنم؟',
    answer:
      'در صفحه هر محصول، یک راهنمای اندازه‌گیری دقیق (بر حسب سانتیمتر) قرار داده شده است. لطفاً قبل از خرید، با استفاده از یک خطکش یا متر، اندازه مورد نیاز خود را مطابق با راهنما کنترل کنید.',
  },
  {
    id: '6',
    question: 'چگونه از محصولات چرمی خود نگهداری کنم؟',
    answer:
      '    از تماس طولانی‌مدت با آب و نور مستقیم خورشید خودداری کنید. برای تمیز کردن از یک پارچه نرم و خشک استفاده کنید. هر ۶ تا ۱۲ ماه یکبار با استفاده از مغز چرم (Leather Conditioner) محصول خود را تغذیه کنید تا نرمی و انعطاف آن حفظ شود. هنگامی که از محصول استفاده نمی‌کنید، آن را درون کیسه پارچه‌ای خود (دماری) قرار داده و در جای خشک و خنک نگهداری کنید.',
  },
]
const FaqPage = () => {
  return (
    <section className="relative w-full overflow-hidden py-16">
      <Spotlight
        gradientFirst="radial-gradient(68.54% 68.72% at 55.02% 31.46%, hsla(336, 100%, 50%, 0.08) 0, hsla(341, 100%, 55%, 0.04) 50%, hsla(336, 100%, 45%, 0) 80%)"
        gradientSecond="radial-gradient(50% 50% at 50% 50%, hsla(333, 100%, 85%, 0.08) 0, hsla(335, 100%, 55%, 0.04) 80%, transparent 100%)"
        gradientThird="radial-gradient(50% 50% at 50% 50%, hsla(332, 100%, 85%, 0.06) 0, hsla(327, 100%, 85%, 0.06) 80%, transparent 100%)"
      />
      <div className="bg-primary/5 absolute top-20 -left-20 h-64 w-64 rounded-full blur-3xl" />
      <div className="bg-primary/5 absolute -right-20 bottom-20 h-64 w-64 rounded-full blur-3xl" />
      <FAQ faqs={faqs} />
    </section>
  )
}

export default FaqPage
